alex-roos-website.org
#+TITLE: Alex Roos Work Website
#+STARTUP: content
# #+HUGO_BASE_DIR: /sshx:tipxmr:/home/tipxmr/alex-roos/
#+HUGO_BASE_DIR: /home/alex/Coding/alex-roos/
# #+HUGO_AUTO_SET_LASTMOD: t
#+AUTHOR: Alex Roos

** DONE Git
:PROPERTIES:
:EXPORT_FILE_NAME: git
:EXPORT_HUGO_SECTION: thoughts
:EXPORT_HUGO_TAGS: opensource framework
:EXPORT_HUGO_PUBLISHDATE: 2021-03-03
:END:
Git is just one of these tools, that I cannot believe I could live without.

*** First steps
I had my first experience with Git, when I partnered up with an acquaintance for a project. In the beginning it was somewhat new of course, but the benefits of using a version control system like git quickly dawned on me.

My amazement was even greater, when I found out that Linus Torvalds was not only responsible for the [[GNU/Linux]] Kernel, but also for git. This discovery solidified once more my passion for FLOSS.
*** The role git plays for me
I understand, why git takes a central role in software projects. For me personally, the use-cases are vast. Not only do we use git to work on [[TipXMR]], but I also backup my dotfiles on it or to create a [[https://github.com/AlexRoosWork][project portfolio]].

There is even a way to host this website with Hugo over Git!
*** Magit
Of course, [[Doom Emacs]] has to be mentioned once more. Within Emacs, the tool Magit provides powerful features to interact with repositories. It is also the tool I use to make changes to the [[https://github.com/AlexRoosWork/Portfolio-Website][repo of this very website]].
