content/thoughts/git.md
+++
title = "Git"
author = ["Alex Roos"]
publishDate = 2021-03-03
tags = ["opensource", "framework"]
draft = false
+++

Git is just one of these tools, that I cannot believe I could live without.

## First steps {#first-steps}

I had my first experience with Git, when I partnered up with an acquaintance for a project. In the beginning it was somewhat new of course, but the benefits of using a version control system like git quickly dawned on me.

My amazement was even greater, when I found out that Linus Torvalds was not only responsible for the [GNU/Linux]({{< relref "linux" >}}) Kernel, but also for git. This discovery solidified once more my passion for FLOSS.

## The role git plays for me {#the-role-git-plays-for-me}

I understand, why git takes a central role in software projects. For me personally, the use-cases are vast. Not only do we use git to work on [TipXMR]({{< relref "TipXMR" >}}), but I also backup my dotfiles on it or to create a [project portfolio](https://github.com/AlexRoosWork).

There is even a way to host this website with Hugo over Git!

## Magit {#magit}

Of course, [Doom Emacs]({{< relref "doom" >}}) has to be mentioned once more. Within Emacs, the tool Magit provides powerful features to interact with repositories. It is also the tool I use to make changes to the [repo of this very website](https://github.com/AlexRoosWork/Portfolio-Website).
